#+SETUPFILE: ~/.emacs.d/org-templates/template.org
#+TITLE: msgpack

* 什么是MessagePack

[[https://msgpack.org/][MessagePack]] 是一个效率极高的二进制序列化形式(协议).目前已经有很多种对它做了支持.它比json的效率要高很多.

* Python msgpack

[[https://pypi.org/project/msgpack/][Python - msgpack]]

#+begin_src shell
  pip install msgpack
#+end_src

* Python msgpack 的使用

#+begin_src python :results output
  import msgpack

  a = [1,2,3]
  b = msgpack.packb(a);
  print(a, b)

  c = msgpack.unpackb(b)
  print(c, b)
#+end_src

#+RESULTS:
: [1, 2, 3] b'\x93\x01\x02\x03'
: [1, 2, 3] b'\x93\x01\x02\x03'

* 在流中使用
#+begin_src python :results output
  import msgpack
  import types
  from io import BytesIO

  buf = BytesIO()
  for i in range(5):
      buf.write(msgpack.packb("hello {}".format(i)));

  buf.seek(0)

  unpacker = msgpack.Unpacker(buf)
  print(unpacker, isinstance(unpacker, types.GeneratorType))

  for unpacked in unpacker:
      print(unpacked, end=",")
#+end_src

#+RESULTS:
: <msgpack._cmsgpack.Unpacker object at 0x556a7495d7d0> False
: hello 0,hello 1,hello 2,hello 3,hello 4,

* 自定义数据类型
#+begin_src python :results output
  import msgpack

  class MyDataType:

      def __init__(self, value):
          self.value = value

  def my_encode(obj):
      if isinstance(obj, MyDataType):
          return {"value": obj.value, "encode": True}
      return obj

  def my_decode(obj):
      if obj.get("encode"):
          return MyDataType(value=obj.get("value"))
      return obj

  obj = MyDataType(value=10)

  packed_data = msgpack.packb(obj, default=my_encode)
  print(packed_data)
  unpacked_data = msgpack.unpackb(packed_data, object_hook=my_decode)
  print(unpacked_data)
#+end_src

#+RESULTS:
: b'\x82\xa5value\n\xa6encode\xc3'
: <__main__.MyDataType object at 0x7f35838619a0>
